app/Controllers/AccountController.php

INSERT INTO `accounts` (`name`, `email`, `password`, `token`, `type`, `status`) VALUES ('Arjay B. Erasmo', 'erasmoarjhay4@gmail.com', '$2y$10$omv4rZZPKUnhcskT/pZZbOan6M2j5Tp7050ZTNLD9HjjGCfcoI4U2', 'dB9RAzwcsExhiTID30entopmNaX8LQfyuHPZ7g1SY2C5bWFJlMkrV4OUKGjq6v', 'client', 'inactive')
---
    public function store()
    {
        helper(['form']);
        $rules = [
            'name' => 'required|min_length[5]|max_length[50]',
            'email' => 'required|min_length[12]|max_length[100]|valid_email|is_unique[accounts.email]',
            'password' => 'required|min_length[8]|max_length[50]',
            'confirmpassword' => 'matches[password]'
        ];
        if($this->validate($rules)){
            $ac = new AccountModel();
            $token = $this->token(100);
            $to = $this->request->getVar('email');
            $data = [
                'name' => $this->request->getVar('name'),
                'email' => $to,
                'password' => password_hash($this->request->getVar('password'), PASSWORD_DEFAULT),
                'token' => $token,
                'type' => 'client',
                'status' => 'inactive'
            ];
            $ac->save($data);

SELECT *
FROM `accounts`
WHERE `email` = 'erasmoarjhay4@gmail.com'
 LIMIT 1
---
    public function auth()
    {
        $session = session();
        $ac = new AccountModel();
        $email = $this->request->getVar('email');
        $password = $this->request->getVar('password');
        $d = $ac->where('email', $email)->first();