app/Controllers/AdminController.php

    public function products()
    {
        $pr = new ProductsModel();
        $data = [
            'products' => $pr->findAll()
        ];
---
SELECT *
FROM `products`