app/Controllers/Home.php

SELECT *
FROM `products`
WHERE `quantity` > '0'
---
    public function productlist()
    {
        $pr = new ProductsModel();
        $data = [
            'products' => $pr->where('quantity >', '0')->findAll()
        ];

SELECT SUM(`total`) AS `total`
FROM `cart`
WHERE `user_id` IS NULL
 LIMIT 1
---
    public function cart()
    {
        $cart_model = new \App\Models\CartModel();
        $id = $this->request->getPost('id');
        $price = $this->request->getPost('price');
        if(!empty($id))
        {
            $data = [
                'menu_id' => $id,
                'user_id' => session()->get('id'),
                'total' => $price
            ];

            if($cart_model->insert($data)){
                return redirect()->route('cart');
            }
        }
        $data = [
            'cart_item' => $cart_model->select("*, concat(size, '<br>' ,color) as detail")
            ->join('products', 'products.id = cart.menu_id', 'inner')
            ->findAll(),

            'total' => $cart_model->selectSum('total')
            ->where('user_id', $id)->first(),